Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
#define USB_WRAP_VREFH    0x00000003
#define USB_WRAP_VREFH_M  ((USB_WRAP_VREFH_V)<<(USB_WRAP_VREFH_S))
#define USB_WRAP_VREFH_V  0x3
#define USB_WRAP_VREFH_S  7

/* USB_WRAP_EXCHG_PINS : R/W ;bitpos:[6] ;default: 1'b0 ;
 * description: USB D+ D- exchange.
 */

#define USB_WRAP_EXCHG_PINS    (BIT(6))
#define USB_WRAP_EXCHG_PINS_M  (BIT(6))
#define USB_WRAP_EXCHG_PINS_V  0x1
#define USB_WRAP_EXCHG_PINS_S  6

/* USB_WRAP_EXCHG_PINS_OVERRIDE : R/W ;bitpos:[5] ;default: 1'b0 ;
 * description: Enable software controlle USB D+ D- exchange.
 */

#define USB_WRAP_EXCHG_PINS_OVERRIDE    (BIT(5))
#define USB_WRAP_EXCHG_PINS_OVERRIDE_M  (BIT(5))
#define USB_WRAP_EXCHG_PINS_OVERRIDE_V  0x1
#define USB_WRAP_EXCHG_PINS_OVERRIDE_S  5

/* USB_WRAP_DBNCE_FLTR_BYPASS : R/W ;bitpos:[4] ;default: 1'b0 ;
 * description: Bypass Debounce filters for avalid,bvalid,
 * vbusvalid,session end, id signals.
 */

#define USB_WRAP_DBNCE_FLTR_BYPASS    (BIT(4))
#define USB_WRAP_DBNCE_FLTR_BYPASS_M  (BIT(4))
#define USB_WRAP_DBNCE_FLTR_BYPASS_V  0x1
#define USB_WRAP_DBNCE_FLTR_BYPASS_S  4

/* USB_WRAP_DFIFO_FORCE_PD : R/W ;bitpos:[3] ;default: 1'b0 ;
 * description: Force the dfifo to go into low power mode.
 * The data in dfifo will not lost..
 */

#define USB_WRAP_DFIFO_FORCE_PD    (BIT(3))
#define USB_WRAP_DFIFO_FORCE_PD_M  (BIT(3))
#define USB_WRAP_DFIFO_FORCE_PD_V  0x1
#define USB_WRAP_DFIFO_FORCE_PD_S  3

/* USB_WRAP_PHY_SEL : R/W ;bitpos:[2] ;default: 1'b0 ;
 * description: Select internal external PHY.
 */

#define USB_WRAP_PHY_SEL    (BIT(2))
#define USB_WRAP_PHY_SEL_M  (BIT(2))
#define USB_WRAP_PHY_SEL_V  0x1
#define USB_WRAP_PHY_SEL_S  2

/* USB_WRAP_SRP_SESSEND_VALUE : R/W ;bitpos:[1] ;default: 1'b0 ;
 * description: Software over-ride value of srp session end signal..
 */

#define USB_WRAP_SRP_SESSEND_VALUE    (BIT(1))
#define USB_WRAP_SRP_SESSEND_VALUE_M  (BIT(1))
#define USB_WRAP_SRP_SESSEND_VALUE_V  0x1
#define USB_WRAP_SRP_SESSEND_VALUE_S  1

/* USB_WRAP_SRP_SESSEND_OVERRIDE : R/W ;bitpos:[0] ;default: 1'b0 ;
 * description: This bit is used to enable the software over-ride
 * of srp session end signal..
 */

#define USB_WRAP_SRP_SESSEND_OVERRIDE    (BIT(0))
#define USB_WRAP_SRP_SESSEND_OVERRIDE_M  (BIT(0))
#define USB_WRAP_SRP_SESSEND_OVERRIDE_V  0x1
#define USB_WRAP_SRP_SESSEND_OVERRIDE_S  0

#define USB_WRAP_TEST_CONF_REG          (DR_REG_USB_WRAP_BASE + 0x4)

/* USB_WRAP_TEST_RX_DM : RO ;bitpos:[6] ;default: 1'b0 ;
 * description: USB D- rx value in test.
 */

#define USB_WRAP_TEST_RX_DM    (BIT(6))
#define USB_WRAP_TEST_RX_DM_M  (BIT(6))
#define USB_WRAP_TEST_RX_DM_V  0x1
#define USB_WRAP_TEST_RX_DM_S  6

/* USB_WRAP_TEST_RX_DP : RO ;bitpos:[5] ;default: 1'b0 ;
 * description: USB D+ rx value in test.
 */

#define USB_WRAP_TEST_RX_DP    (BIT(5))
#define USB_WRAP_TEST_RX_DP_M  (BIT(5))
#define USB_WRAP_TEST_RX_DP_V  0x1
#define USB_WRAP_TEST_RX_DP_S  5

/* USB_WRAP_TEST_RX_RCV : RO ;bitpos:[4] ;default: 1'b0 ;
 * description: USB differential rx value in test.
 */

#define USB_WRAP_TEST_RX_RCV    (BIT(4))
#define USB_WRAP_TEST_RX_RCV_M  (BIT(4))
#define USB_WRAP_TEST_RX_RCV_V  0x1
#define USB_WRAP_TEST_RX_RCV_S  4

/* USB_WRAP_TEST_TX_DM : R/W ;bitpos:[3] ;default: 1'b0 ;
 * description: USB D- tx value in test.
 */

#define USB_WRAP_TEST_TX_DM    (BIT(3))
#define USB_WRAP_TEST_TX_DM_M  (BIT(3))
#define USB_WRAP_TEST_TX_DM_V  0x1
#define USB_WRAP_TEST_TX_DM_S  3

/* USB_WRAP_TEST_TX_DP : R/W ;bitpos:[2] ;default: 1'b0 ;
 * description: USB D+ tx value in test.
 */

#define USB_WRAP_TEST_TX_DP    (BIT(2))
#define USB_WRAP_TEST_TX_DP_M  (BIT(2))
#define USB_WRAP_TEST_TX_DP_V  0x1
#define USB_WRAP_TEST_TX_DP_S  2

/* USB_WRAP_TEST_USB_OE : R/W ;bitpos:[1] ;default: 1'b0 ;
 * description: USB pad oen in test.
 */

#define USB_WRAP_TEST_USB_OE    (BIT(1))
#define USB_WRAP_TEST_USB_OE_M  (BIT(1))
#define USB_WRAP_TEST_USB_OE_V  0x1
#define USB_WRAP_TEST_USB_OE_S  1

/* USB_WRAP_TEST_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ;
 * description: Enable test of the USB pad.
 */

#define USB_WRAP_TEST_ENABLE    (BIT(0))
#define USB_WRAP_TEST_ENABLE_M  (BIT(0))
#define USB_WRAP_TEST_ENABLE_V  0x1
#define USB_WRAP_TEST_ENABLE_S  0

#define USB_WRAP_DATE_REG          (DR_REG_USB_WRAP_BASE + 0x3FC)

/* USB_WRAP_DATE : R/W ;bitpos:[31:0] ;default: 32'h2102010 ;
 * description: Date register.
 */

#define USB_WRAP_DATE    0xFFFFFFFF
#define USB_WRAP_DATE_M  ((USB_WRAP_DATE_V)<<(USB_WRAP_DATE_S))
#define USB_WRAP_DATE_V  0xFFFFFFFF
#define USB_WRAP_DATE_S  0

/* General definitions */

#define OTG_EPTYPE_CTRL               (0) /* Control */
#define OTG_EPTYPE_ISOC               (1) /* Isochronous */
#define OTG_EPTYPE_BULK               (2) /* Bulk */
#define OTG_EPTYPE_INTR               (3) /* Interrupt */

#define OTG_PID_DATA0                 (0)
#define OTG_PID_DATA2                 (1)
#define OTG_PID_DATA1                 (2)
#define OTG_PID_MDATA                 (3) /* Non-control */
#define OTG_PID_SETUP                 (3) /* Control */

/* Register Offsets *********************************************************/

/* Core global control and status registers */

#define ESP32S3_OTG_GOTGCTL_OFFSET      0x0000 /* Control and status register */
#define ESP32S3_OTG_GOTGINT_OFFSET      0x0004 /* Interrupt register */
#define ESP32S3_OTG_GAHBCFG_OFFSET      0x0008 /* AHB configuration register */
#define ESP32S3_OTG_GUSBCFG_OFFSET      0x000c /* USB configuration register */
#define ESP32S3_OTG_GRSTCTL_OFFSET      0x0010 /* Reset register */
#define ESP32S3_OTG_GINTSTS_OFFSET      0x0014 /* Core interrupt register */
#define ESP32S3_OTG_GINTMSK_OFFSET      0x0018 /* Interrupt mask register */
#define ESP32S3_OTG_GRXSTSR_OFFSET      0x001c /* Receive status debug read/OTG status read register */
#define ESP32S3_OTG_GRXSTSP_OFFSET      0x0020 /* Receive status debug read/OTG status pop register */
#define ESP32S3_OTG_GRXFSIZ_OFFSET      0x0024 /* Receive FIFO size register */
#define ESP32S3_OTG_HNPTXFSIZ_OFFSET    0x0028 /* Host non-periodic transmit FIFO size register */
#define ESP32S3_OTG_DIEPTXF0_OFFSET     0x0028 /* Endpoint 0 Transmit FIFO size */
#define ESP32S3_OTG_HNPTXSTS_OFFSET     0x002c /* Non-periodic transmit FIFO/queue status register */
#define ESP32S3_OTG_GCCFG_OFFSET        0x0038 /* General core configuration register */
#define ESP32S3_OTG_CID_OFFSET          0x003c /* Core ID register  */
#define ESP32S3_OTG_HPTXFSIZ_OFFSET     0x0100 /* Host periodic transmit FIFO size register */

