Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
#define ESP32S3_OTG_DIEPTXF_OFFSET(n)   (0x0104+(((n)-1) << 2))

/* Host-mode control and status registers */

#define ESP32S3_OTG_HCFG_OFFSET         0x0400 /* Host configuration register */
#define ESP32S3_OTG_HFIR_OFFSET         0x0404 /* Host frame interval register */
#define ESP32S3_OTG_HFNUM_OFFSET        0x0408 /* Host frame number/frame time remaining register */
#define ESP32S3_OTG_HPTXSTS_OFFSET      0x0410 /* Host periodic transmit FIFO/queue status register */
#define ESP32S3_OTG_HAINT_OFFSET        0x0414 /* Host all channels interrupt register */
#define ESP32S3_OTG_HAINTMSK_OFFSET     0x0418 /* Host all channels interrupt mask register */
#define ESP32S3_OTG_HPRT_OFFSET         0x0440 /* Host port control and status register */

#define ESP32S3_OTG_CHAN_OFFSET(n)      (0x500 + ((n) << 5))
#define ESP32S3_OTG_HCCHAR_CHOFFSET     0x0000 /* Host channel characteristics register */
#define ESP32S3_OTG_HCINT_CHOFFSET      0x0008 /* Host channel interrupt register */
#define ESP32S3_OTG_HCINTMSK_CHOFFSET   0x000c /* Host channel interrupt mask register */
#define ESP32S3_OTG_HCTSIZ_CHOFFSET     0x0010 /* Host channel interrupt register */

#define ESP32S3_OTG_HCCHAR_OFFSET(n)    (0x500 + ((n) << 5))

#define ESP32S3_OTG_HCINT_OFFSET(n)     (0x508 + ((n) << 5))

#define ESP32S3_OTG_HCINTMSK_OFFSET(n)  (0x50c + ((n) << 5))

#define ESP32S3_OTG_HCTSIZ_OFFSET(n)    (0x510 + ((n) << 5))

/* Device-mode control and status registers */

#define ESP32S3_OTG_DCFG_OFFSET         0x0800 /* Device configuration register */
#define ESP32S3_OTG_DCTL_OFFSET         0x0804 /* Device control register */
#define ESP32S3_OTG_DSTS_OFFSET         0x0808 /* Device status register */
#define ESP32S3_OTG_DIEPMSK_OFFSET      0x0810 /* Device IN endpoint common interrupt mask register */
#define ESP32S3_OTG_DOEPMSK_OFFSET      0x0814 /* Device OUT endpoint common interrupt mask register */
#define ESP32S3_OTG_DAINT_OFFSET        0x0818 /* Device all endpoints interrupt register */
#define ESP32S3_OTG_DAINTMSK_OFFSET     0x081c /* All endpoints interrupt mask register */
#define ESP32S3_OTG_DVBUSDIS_OFFSET     0x0828 /* Device VBUS discharge time register */
#define ESP32S3_OTG_DVBUSPULSE_OFFSET   0x082c /* Device VBUS pulsing time register */
#define ESP32S3_OTG_DIEPEMPMSK_OFFSET   0x0834 /* Device IN endpoint FIFO empty interrupt mask register */

#define ESP32S3_OTG_DIEP_OFFSET(n)      (0x0900 + ((n) << 5))
#define ESP32S3_OTG_DIEPCTL_EPOFFSET    0x0000 /* Device endpoint control register */
#define ESP32S3_OTG_DIEPINT_EPOFFSET    0x0008 /* Device endpoint interrupt register */
#define ESP32S3_OTG_DIEPTSIZ_EPOFFSET   0x0010 /* Device IN endpoint transfer size register */
#define ESP32S3_OTG_DTXFSTS_EPOFFSET    0x0018 /* Device IN endpoint transmit FIFO status register */

#define ESP32S3_OTG_DIEPCTL_OFFSET(n)   (0x0900 + ((n) << 5))

#define ESP32S3_OTG_DIEPINT_OFFSET(n)   (0x0908 + ((n) << 5))

#define ESP32S3_OTG_DIEPTSIZ_OFFSET(n)  (0x910 + ((n) << 5))

#define ESP32S3_OTG_DTXFSTS_OFFSET(n)   (0x0918 + ((n) << 5))

#define ESP32S3_OTG_DOEP_OFFSET(n)      (0x0b00 + ((n) << 5))
#define ESP32S3_OTG_DOEPCTL_EPOFFSET    0x0000 /* Device control OUT endpoint 0 control register */
#define ESP32S3_OTG_DOEPINT_EPOFFSET    0x0008 /* Device endpoint-x interrupt register */

#define ESP32S3_OTG_DOEPCTL_OFFSET(n)   (0x0b00 + ((n) << 5))

#define ESP32S3_OTG_DOEPINT_OFFSET(n)   (0x0b08 + ((n) << 5))

#define ESP32S3_OTG_DOEPTSIZ_OFFSET(n)  (0x0b10 + ((n) << 5))

/* Power and clock gating registers */

#define ESP32S3_OTG_PCGCCTL_OFFSET      0x0e00 /* Power and clock gating control register */

/* Data FIFO (DFIFO) access registers */

#define ESP32S3_OTG_DFIFO_DEP_OFFSET(n) (0x1000 + ((n) << 12))
#define ESP32S3_OTG_DFIFO_HCH_OFFSET(n) (0x1000 + ((n) << 12))

/* Register Addresses *******************************************************/

#define ESP32S3_OTG_GOTGCTL             (DR_REG_USB_BASE+ESP32S3_OTG_GOTGCTL_OFFSET)
#define ESP32S3_OTG_GOTGINT             (DR_REG_USB_BASE+ESP32S3_OTG_GOTGINT_OFFSET)
#define ESP32S3_OTG_GAHBCFG             (DR_REG_USB_BASE+ESP32S3_OTG_GAHBCFG_OFFSET)
#define ESP32S3_OTG_GUSBCFG             (DR_REG_USB_BASE+ESP32S3_OTG_GUSBCFG_OFFSET)
#define ESP32S3_OTG_GRSTCTL             (DR_REG_USB_BASE+ESP32S3_OTG_GRSTCTL_OFFSET)
#define ESP32S3_OTG_GINTSTS             (DR_REG_USB_BASE+ESP32S3_OTG_GINTSTS_OFFSET)
#define ESP32S3_OTG_GINTMSK             (DR_REG_USB_BASE+ESP32S3_OTG_GINTMSK_OFFSET)
#define ESP32S3_OTG_GRXSTSR             (DR_REG_USB_BASE+ESP32S3_OTG_GRXSTSR_OFFSET)
#define ESP32S3_OTG_GRXSTSP             (DR_REG_USB_BASE+ESP32S3_OTG_GRXSTSP_OFFSET)
#define ESP32S3_OTG_GRXFSIZ             (DR_REG_USB_BASE+ESP32S3_OTG_GRXFSIZ_OFFSET)
#define ESP32S3_OTG_HNPTXFSIZ           (DR_REG_USB_BASE+ESP32S3_OTG_HNPTXFSIZ_OFFSET)
#define ESP32S3_OTG_DIEPTXF0            (DR_REG_USB_BASE+ESP32S3_OTG_DIEPTXF0_OFFSET)
#define ESP32S3_OTG_HNPTXSTS            (DR_REG_USB_BASE+ESP32S3_OTG_HNPTXSTS_OFFSET)
#define ESP32S3_OTG_GCCFG               (DR_REG_USB_BASE+ESP32S3_OTG_GCCFG_OFFSET)
#define ESP32S3_OTG_CID                 (DR_REG_USB_BASE+ESP32S3_OTG_CID_OFFSET)
#define ESP32S3_OTG_HPTXFSIZ            (DR_REG_USB_BASE+ESP32S3_OTG_HPTXFSIZ_OFFSET)

#define ESP32S3_OTG_DIEPTXF(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DIEPTXF_OFFSET(n))

/* Host-mode control and status registers */

#define ESP32S3_OTG_HCFG                (DR_REG_USB_BASE+ESP32S3_OTG_HCFG_OFFSET)
#define ESP32S3_OTG_HFIR                (DR_REG_USB_BASE+ESP32S3_OTG_HFIR_OFFSET)
#define ESP32S3_OTG_HFNUM               (DR_REG_USB_BASE+ESP32S3_OTG_HFNUM_OFFSET)
#define ESP32S3_OTG_HPTXSTS             (DR_REG_USB_BASE+ESP32S3_OTG_HPTXSTS_OFFSET)
#define ESP32S3_OTG_HAINT               (DR_REG_USB_BASE+ESP32S3_OTG_HAINT_OFFSET)
#define ESP32S3_OTG_HAINTMSK            (DR_REG_USB_BASE+ESP32S3_OTG_HAINTMSK_OFFSET)
#define ESP32S3_OTG_HPRT                (DR_REG_USB_BASE+ESP32S3_OTG_HPRT_OFFSET)

#define ESP32S3_OTG_CHAN(n)             (DR_REG_USB_BASE+ESP32S3_OTG_CHAN_OFFSET(n))

#define ESP32S3_OTG_HCCHAR(n)           (DR_REG_USB_BASE+ESP32S3_OTG_HCCHAR_OFFSET(n))

#define ESP32S3_OTG_HCINT(n)            (DR_REG_USB_BASE+ESP32S3_OTG_HCINT_OFFSET(n))

#define ESP32S3_OTG_HCINTMSK(n)         (DR_REG_USB_BASE+ESP32S3_OTG_HCINTMSK_OFFSET(n))

#define ESP32S3_OTG_HCTSIZ(n)           (DR_REG_USB_BASE+ESP32S3_OTG_HCTSIZ_OFFSET(n))

/* Device-mode control and status registers */

#define ESP32S3_OTG_DCFG                (DR_REG_USB_BASE+ESP32S3_OTG_DCFG_OFFSET)
#define ESP32S3_OTG_DCTL                (DR_REG_USB_BASE+ESP32S3_OTG_DCTL_OFFSET)
#define ESP32S3_OTG_DSTS                (DR_REG_USB_BASE+ESP32S3_OTG_DSTS_OFFSET)
#define ESP32S3_OTG_DIEPMSK             (DR_REG_USB_BASE+ESP32S3_OTG_DIEPMSK_OFFSET)
#define ESP32S3_OTG_DOEPMSK             (DR_REG_USB_BASE+ESP32S3_OTG_DOEPMSK_OFFSET)
#define ESP32S3_OTG_DAINT               (DR_REG_USB_BASE+ESP32S3_OTG_DAINT_OFFSET)
#define ESP32S3_OTG_DAINTMSK            (DR_REG_USB_BASE+ESP32S3_OTG_DAINTMSK_OFFSET)
#define ESP32S3_OTG_DVBUSDIS            (DR_REG_USB_BASE+ESP32S3_OTG_DVBUSDIS_OFFSET)
#define ESP32S3_OTG_DVBUSPULSE          (DR_REG_USB_BASE+ESP32S3_OTG_DVBUSPULSE_OFFSET)
#define ESP32S3_OTG_DIEPEMPMSK          (DR_REG_USB_BASE+ESP32S3_OTG_DIEPEMPMSK_OFFSET)

#define ESP32S3_OTG_DIEP(n)             (DR_REG_USB_BASE+ESP32S3_OTG_DIEP_OFFSET(n))

