Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
#define ESP32S3_OTG_DIEPCTL(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DIEPCTL_OFFSET(n))

#define ESP32S3_OTG_DIEPINT(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DIEPINT_OFFSET(n))

#define ESP32S3_OTG_DIEPTSIZ(n)         (DR_REG_USB_BASE+ESP32S3_OTG_DIEPTSIZ_OFFSET(n))

#define ESP32S3_OTG_DTXFSTS(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DTXFSTS_OFFSET(n))

#define ESP32S3_OTG_DOEP(n)             (DR_REG_USB_BASE+ESP32S3_OTG_DOEP_OFFSET(n))

#define ESP32S3_OTG_DOEPCTL(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DOEPCTL_OFFSET(n))

#define ESP32S3_OTG_DOEPINT(n)          (DR_REG_USB_BASE+ESP32S3_OTG_DOEPINT_OFFSET(n))

#define ESP32S3_OTG_DOEPTSIZ(n)         (DR_REG_USB_BASE+ESP32S3_OTG_DOEPTSIZ_OFFSET(n))

/* Power and clock gating registers */

#define ESP32S3_OTG_PCGCCTL             (DR_REG_USB_BASE+ESP32S3_OTG_PCGCCTL_OFFSET)

/* Data FIFO (DFIFO) access registers */

#define ESP32S3_OTG_DFIFO_DEP(n)        (DR_REG_USB_BASE+ESP32S3_OTG_DFIFO_DEP_OFFSET(n))
#define ESP32S3_OTG_DFIFO_HCH(n)        (DR_REG_USB_BASE+ESP32S3_OTG_DFIFO_HCH_OFFSET(n))

/* USB PHY Registers */

#define ESP32S3_USBPHYC_PLL1            (ESP32S3_USBPHYC_BASE+ESP32S3_USBPHYC_PLL1_OFFSET)
#define ESP32S3_USBPHYC_TUNE            (ESP32S3_USBPHYC_BASE+ESP32S3_USBPHYC_TUNE_OFFSET)
#define ESP32S3_USBPHYC_LDO             (ESP32S3_USBPHYC_BASE+ESP32S3_USBPHYC_LDO_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Core global control and status registers */

/* Control and status register */

#define OTG_GOTGCTL_SRQSCS            (1 << 0)  /* Bit 0:  Session request success */
#define OTG_GOTGCTL_SRQ               (1 << 1)  /* Bit 1:  Session request */
#define OTG_GOTGCTL_VBVALOEN          (1 << 2)  /* Bit 2:  VBUS valid override enable */
#define OTG_GOTGCTL_VBVALOVAL         (1 << 3)  /* Bit 3:  VBUS valid override value */
#define OTG_GOTGCTL_AVALOEN           (1 << 4)  /* Bit 4:  A-peripheral session valid override enable */
#define OTG_GOTGCTL_AVALOVAL          (1 << 5)  /* Bit 5:  A-peripheral session valid override value */
#define OTG_GOTGCTL_BVALOEN           (1 << 6)  /* Bit 6:  B-peripheral session valid override enable */
#define OTG_GOTGCTL_BVALOVAL          (1 << 7)  /* Bit 7:  B-peripheral session valid override value  */
#define OTG_GOTGCTL_HNGSCS            (1 << 8)  /* Bit 8:  Host negotiation success */
#define OTG_GOTGCTL_HNPRQ             (1 << 9)  /* Bit 9:  HNP request */
#define OTG_GOTGCTL_HSHNPEN           (1 << 10) /* Bit 10: host set HNP enable */
#define OTG_GOTGCTL_DHNPEN            (1 << 11) /* Bit 11: Device HNP enabled */
#define OTG_GOTGCTL_EHEN              (1 << 12) /* Bit 12: Embedded host enable */
/* Bits 13-15: Reserved, must be kept at reset value */
#define OTG_GOTGCTL_CIDSTS            (1 << 16) /* Bit 16: Connector ID status */
#define OTG_GOTGCTL_DBCT              (1 << 17) /* Bit 17: Long/short debounce time */
#define OTG_GOTGCTL_ASVLD             (1 << 18) /* Bit 18: A-session valid */
#define OTG_GOTGCTL_BSVLD             (1 << 19) /* Bit 19: B-session valid */
#define OTG_GOTGCTL_OTGVER            (1 << 20) /* Bit 20: OTG version */
/* Bits 21-31: Reserved, must be kept at reset value */

/* Interrupt register */

/*                                                 Bits 1:0 Reserved,
 *                                                must be kept at reset value
 */
#define OTG_GOTGINT_SEDET             (1 << 2)  /* Bit 2: Session end detected */
/* Bits 3-7: Reserved, must be kept at reset value */
#define OTG_GOTGINT_SRSSCHG           (1 << 8)  /* Bit 8: Session request success status change */
#define OTG_GOTGINT_HNSSCHG           (1 << 9)  /* Bit 9: Host negotiation success status change */
/* Bits 16:10 Reserved, must be kept at reset value */
#define OTG_GOTGINT_HNGDET            (1 << 17) /* Bit 17: Host negotiation detected */
#define OTG_GOTGINT_ADTOCHG           (1 << 18) /* Bit 18: A-device timeout change */
#define OTG_GOTGINT_DBCDNE            (1 << 19) /* Bit 19: Debounce done */
#define OTG_GOTGINT_IDCHNG            (1 << 20) /* Bit 20: Change in ID pin input value */
/* Bits 21-31: Reserved, must be kept at reset value */

/* AHB configuration register */

#define OTG_GAHBCFG_GINTMSK           (1 << 0)  /* Bit 0: Global interrupt mask */
/* Bits 1-6: Reserved, must be kept at reset value */
#define OTG_GAHBCFG_TXFELVL           (1 << 7)  /* Bit 7: TxFIFO empty level */
#define OTG_GAHBCFG_PTXFELVL          (1 << 8)  /* Bit 8: Periodic TxFIFO empty level */
/* Bits 20-31: Reserved, must be kept at reset value */

/* USB configuration register */

#define OTG_GUSBCFG_TOCAL_SHIFT       (0)       /* Bits 0-2: FS timeout calibration */
#define OTG_GUSBCFG_TOCAL_MASK        (7 << OTG_GUSBCFG_TOCAL_SHIFT)
/* Bits 3-5: Reserved, must be kept at reset value */
#define OTG_GUSBCFG_ULPISEL           (1 << 4)  /* Bit 4: Select which high speed interface is to be used only ? */
#define OTG_GUSBCFG_PHYSEL            (1 << 6)  /* Bit 6: Full Speed serial transceiver select */
/* Bit 7: Reserved, must be kept at reset value */
#define OTG_GUSBCFG_SRPCAP            (1 << 8)  /* Bit 8: SRP-capable */
#define OTG_GUSBCFG_HNPCAP            (1 << 9)  /* Bit 9: HNP-capable */
#define OTG_GUSBCFG_TRDT_SHIFT        (10)      /* Bits 10-13: USB turnaround time */
#define OTG_GUSBCFG_TRDT_MASK         (15 << OTG_GUSBCFG_TRDT_SHIFT)
#  define OTG_GUSBCFG_TRDT(n)         ((n) << OTG_GUSBCFG_TRDT_SHIFT)
/* Bit 14: Reserved, must be kept at reset value */
#define OTG_GUSBCFG_PHYLPC            (1 << 15) /* Bit 15: PHY Low-power clock select for USB OTG HS */
/* Bit 16: Reserved, must be kept at reset value */
#define OTG_GUSBCFG_ULPIFSLS          (1 << 17) /* Bit 17: ULPI FS/LS select for USB OTG HS */
#define OTG_GUSBCFG_ULPIAR            (1 << 18) /* Bit 18: ULPI Auto-resume for USB OTG HS */
#define OTG_GUSBCFG_ULPICSM           (1 << 19) /* Bit 19: ULPI clock SuspendM for USB OTG HS */
#define OTG_GUSBCFG_ULPIEVBUSD        (1 << 20) /* Bit 20: ULPI External VBUS Drive for USB OTG HS */
#define OTG_GUSBCFG_ULPIEVBUSI        (1 << 21) /* Bit 21: ULPI external VBUS indicator for USB OTG HS */
#define OTG_GUSBCFG_TSDPS             (1 << 22) /* Bit 22: TermSel DLine pulsing selection for USB OTG HS */
#define OTG_GUSBCFG_PCCI              (1 << 23) /* Bit 23: Indicator complement for USB OTG HS */
#define OTG_GUSBCFG_PTCI              (1 << 24) /* Bit 24: Indicator pass through for USB OTG HS */
#define OTG_GUSBCFG_ULPIIPD           (1 << 25) /* Bit 24: ULPI interface protect disable for USB OTG HS */
/* Bit 26-28: Reserved, must be kept at reset value */
#define OTG_GUSBCFG_FHMOD             (1 << 29) /* Bit 29: Force host mode */
#define OTG_GUSBCFG_FDMOD             (1 << 30) /* Bit 30: Force device mode */
/* Bits 20-31: Reserved, must be kept at reset value */

/* Reset register */

#define OTG_GRSTCTL_CSRST             (1 << 0)  /* Bit 0: Core soft reset */
#define OTG_GRSTCTL_HSRST             (1 << 1)  /* Bit 1: HCLK soft reset */
#define OTG_GRSTCTL_FCRST             (1 << 2)  /* Bit 2: Host frame counter reset */
/* Bit 3 Reserved, must be kept at reset value */
#define OTG_GRSTCTL_RXFFLSH           (1 << 4)  /* Bit 4: RxFIFO flush */
#define OTG_GRSTCTL_TXFFLSH           (1 << 5)  /* Bit 5: TxFIFO flush */
#define OTG_GRSTCTL_TXFNUM_SHIFT      (6)       /* Bits 6-10: TxFIFO number */
#define OTG_GRSTCTL_TXFNUM_MASK       (31 << OTG_GRSTCTL_TXFNUM_SHIFT)
#  define OTG_GRSTCTL_TXFNUM_HNONPER  (0 << OTG_GRSTCTL_TXFNUM_SHIFT)   /* Non-periodic TxFIFO flush in host mode */
#  define OTG_GRSTCTL_TXFNUM_HPER     (1 << OTG_GRSTCTL_TXFNUM_SHIFT)   /* Periodic TxFIFO flush in host mode */
#  define OTG_GRSTCTL_TXFNUM_HALL     (16 << OTG_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in host mode.*/
#  define OTG_GRSTCTL_TXFNUM_D(n)     ((n) << OTG_GRSTCTL_TXFNUM_SHIFT) /* TXFIFO n flush in device mode, n=0-15 */
#  define OTG_GRSTCTL_TXFNUM_DALL     (16 << OTG_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in device mode.*/

/*                                                 Bits 11-31: Reserved,
 *                                                must be kept at reset value
 */
#define OTG_GRSTCTL_AHBIDL            (1 << 31) /* Bit 31: AHB master idle */

