Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
/* Core interrupt and Interrupt mask registers */

#define OTG_GINTSTS_CMOD              (1 << 0)  /* Bit 0:  Current mode of operation */
#  define OTG_GINTSTS_DEVMODE         (0)
#  define OTG_GINTSTS_HOSTMODE        (OTG_GINTSTS_CMOD)
#define OTG_GINT_MMIS                 (1 << 1)  /* Bit 1:  Mode mismatch interrupt */
#define OTG_GINT_OTG                  (1 << 2)  /* Bit 2:  OTG interrupt */
#define OTG_GINT_SOF                  (1 << 3)  /* Bit 3:  Start of frame */
#define OTG_GINT_RXFLVL               (1 << 4)  /* Bit 4:  RxFIFO non-empty */
#define OTG_GINT_NPTXFE               (1 << 5)  /* Bit 5:  Non-periodic TxFIFO empty */
#define OTG_GINT_GINAKEFF             (1 << 6)  /* Bit 6:  Global IN non-periodic NAK effective */
#define OTG_GINT_GONAKEFF             (1 << 7)  /* Bit 7:  Global OUT NAK effective */
#define OTG_GINT_RES89                (3 << 8)  /* Bits 8-9: Reserved, must be kept at reset value */
#define OTG_GINT_ESUSP                (1 << 10) /* Bit 10: Early suspend */
#define OTG_GINT_USBSUSP              (1 << 11) /* Bit 11: USB suspend */
#define OTG_GINT_USBRST               (1 << 12) /* Bit 12: USB reset */
#define OTG_GINT_ENUMDNE              (1 << 13) /* Bit 13: Enumeration done */
#define OTG_GINT_ISOODRP              (1 << 14) /* Bit 14: Isochronous OUT packet dropped interrupt */
#define OTG_GINT_EOPF                 (1 << 15) /* Bit 15: End of periodic frame interrupt */
#define OTG_GINT_RES1617              (3 << 16) /* Bits 16-17 Reserved, must be kept at reset value */
#define OTG_GINT_IEP                  (1 << 18) /* Bit 18: IN endpoint interrupt */
#define OTG_GINT_OEP                  (1 << 19) /* Bit 19: OUT endpoint interrupt */
#define OTG_GINT_IISOIXFR             (1 << 20) /* Bit 20: Incomplete isochronous IN transfer */
#define OTG_GINT_IISOOXFR             (1 << 21) /* Bit 21: Incomplete isochronous OUT transfer (device) */
#define OTG_GINT_IPXFR                (1 << 21) /* Bit 21: Incomplete periodic transfer (host) */
#define OTG_GINT_RES22                (1 << 22) /* Bit 22: Reserved, must be kept at reset value */
#define OTG_GINT_DATAFSUSP            (1 << 22) /* Bit 22: Data fetch suspended for USB OTG HS */
#define OTG_GINT_RES23                (1 << 23) /* Bit 23: Reserved, must be kept at reset value */
#define OTG_GINT_RSTDET               (1 << 23) /* Bit 23: Reset detected interrupt */
#define OTG_GINT_HPRT                 (1 << 24) /* Bit 24: Host port interrupt */
#define OTG_GINT_HC                   (1 << 25) /* Bit 25: Host channels interrupt */
#define OTG_GINT_PTXFE                (1 << 26) /* Bit 26: Periodic TxFIFO empty */
#define OTG_GINT_LPMINT               (1 << 27) /* Bit 27: LPM interrupt */
#define OTG_GINT_RES27                (1 << 27) /* Bit 27: Reserved, must be kept at reset value */
#define OTG_GINT_CIDSCHG              (1 << 28) /* Bit 28: Connector ID status change */
#define OTG_GINT_DISC                 (1 << 29) /* Bit 29: Disconnect detected interrupt */
#define OTG_GINT_SRQ                  (1 << 30) /* Bit 30: Session request/new session detected interrupt */
#define OTG_GINT_WKUP                 (1 << 31) /* Bit 31: Resume/remote wakeup detected interrupt */

/* Receive status debug read/OTG status read and pop registers (host mode) */

#define OTG_GRXSTSH_CHNUM_SHIFT       (0)       /* Bits 0-3: Channel number */
#define OTG_GRXSTSH_CHNUM_MASK        (15 << OTG_GRXSTSH_CHNUM_SHIFT)
#define OTG_GRXSTSH_BCNT_SHIFT        (4)       /* Bits 4-14: Byte count */
#define OTG_GRXSTSH_BCNT_MASK         (0x7ff << OTG_GRXSTSH_BCNT_SHIFT)
#define OTG_GRXSTSH_DPID_SHIFT        (15)      /* Bits 15-16: Data PID */
#define OTG_GRXSTSH_DPID_MASK         (3 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA0      (0 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA2      (1 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA1      (2 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_MDATA      (3 << OTG_GRXSTSH_DPID_SHIFT)
#define OTG_GRXSTSH_PKTSTS_SHIFT      (17)      /* Bits 17-20: Packet status */
#define OTG_GRXSTSH_PKTSTS_MASK       (15 << OTG_GRXSTSH_PKTSTS_SHIFT)
#  define OTG_GRXSTSH_PKTSTS_INRECVD  (2 << OTG_GRXSTSH_PKTSTS_SHIFT) /* IN data packet received */
#  define OTG_GRXSTSH_PKTSTS_INDONE   (3 << OTG_GRXSTSH_PKTSTS_SHIFT) /* IN transfer completed */
#  define OTG_GRXSTSH_PKTSTS_DTOGERR  (5 << OTG_GRXSTSH_PKTSTS_SHIFT) /* Data toggle error */
#  define OTG_GRXSTSH_PKTSTS_HALTED   (7 << OTG_GRXSTSH_PKTSTS_SHIFT) /* Channel halted */

/*                                                 Bits 21-31: Reserved,
 *                                               must be kept at reset value
 */

/* Receive status debug read/OTG status read and pop registers
 * (device mode)
 */

#define OTG_GRXSTSD_EPNUM_SHIFT       (0)       /* Bits 0-3: Endpoint number */
#define OTG_GRXSTSD_EPNUM_MASK        (15 << OTG_GRXSTSD_EPNUM_SHIFT)
#define OTG_GRXSTSD_BCNT_SHIFT        (4)       /* Bits 4-14: Byte count */
#define OTG_GRXSTSD_BCNT_MASK         (0x7ff << OTG_GRXSTSD_BCNT_SHIFT)
#define OTG_GRXSTSD_DPID_SHIFT        (15)      /* Bits 15-16: Data PID */
#define OTG_GRXSTSD_DPID_MASK         (3 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA0      (0 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA2      (1 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA1      (2 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_MDATA      (3 << OTG_GRXSTSD_DPID_SHIFT)
#define OTG_GRXSTSD_PKTSTS_SHIFT      (17)      /* Bits 17-20: Packet status */
#define OTG_GRXSTSD_PKTSTS_MASK       (15 << OTG_GRXSTSD_PKTSTS_SHIFT)
#  define OTG_GRXSTSD_PKTSTS_OUTNAK     (1 << OTG_GRXSTSD_PKTSTS_SHIFT) /* Global OUT NAK */
#  define OTG_GRXSTSD_PKTSTS_OUTRECVD   (2 << OTG_GRXSTSD_PKTSTS_SHIFT) /* OUT data packet received */
#  define OTG_GRXSTSD_PKTSTS_OUTDONE    (3 << OTG_GRXSTSD_PKTSTS_SHIFT) /* OUT transfer completed */
#  define OTG_GRXSTSD_PKTSTS_SETUPDONE  (4 << OTG_GRXSTSD_PKTSTS_SHIFT) /* SETUP transaction completed */
#  define OTG_GRXSTSD_PKTSTS_SETUPRECVD (6 << OTG_GRXSTSD_PKTSTS_SHIFT) /* SETUP data packet received */

#define OTG_GRXSTSD_FRMNUM_SHIFT      (21)      /* Bits 21-24: Frame number */
#define OTG_GRXSTSD_FRMNUM_MASK       (15 << OTG_GRXSTSD_FRMNUM_SHIFT)
/* Bits 25-31: Reserved, must be kept at reset value */

/* Receive FIFO size register */

#define OTG_GRXFSIZ_MASK              (0xffff)

