Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
#define OTG_HPRT_PSPD_SHIFT           (17)      /* Bits 17-18: Port speed */
#define OTG_HPRT_PSPD_MASK            (3 << OTG_HPRT_PSPD_SHIFT)
#  define OTG_HPRT_PSPD_FS            (1 << OTG_HPRT_PSPD_SHIFT) /* Full speed */
#  define OTG_HPRT_PSPD_LS            (2 << OTG_HPRT_PSPD_SHIFT) /* Low speed */

/*                                                 Bits 19-31: Reserved,
 *                                               must be kept at reset value
 */

/* Host channel-n characteristics register */

#define OTG_HCCHAR_MPSIZ_SHIFT        (0)       /* Bits 0-10: Maximum packet size */
#define OTG_HCCHAR_MPSIZ_MASK         (0x7ff << OTG_HCCHAR_MPSIZ_SHIFT)
#define OTG_HCCHAR_EPNUM_SHIFT        (11)      /* Bits 11-14: Endpoint number */
#define OTG_HCCHAR_EPNUM_MASK         (15 << OTG_HCCHAR_EPNUM_SHIFT)
#define OTG_HCCHAR_EPDIR              (1 << 15) /* Bit 15: Endpoint direction */
#  define OTG_HCCHAR_EPDIR_OUT        (0)
#  define OTG_HCCHAR_EPDIR_IN         OTG_HCCHAR_EPDIR
/* Bit 16 Reserved, must be kept at reset value */
#define OTG_HCCHAR_LSDEV              (1 << 17) /* Bit 17: Low-speed device */
#define OTG_HCCHAR_EPTYP_SHIFT        (18)      /* Bits 18-19: Endpoint type */
#define OTG_HCCHAR_EPTYP_MASK         (3 << OTG_HCCHAR_EPTYP_SHIFT)
#  define OTG_HCCHAR_EPTYP_CTRL       (0 << OTG_HCCHAR_EPTYP_SHIFT) /* Control */
#  define OTG_HCCHAR_EPTYP_ISOC       (1 << OTG_HCCHAR_EPTYP_SHIFT) /* Isochronous */
#  define OTG_HCCHAR_EPTYP_BULK       (2 << OTG_HCCHAR_EPTYP_SHIFT) /* Bulk */
#  define OTG_HCCHAR_EPTYP_INTR       (3 << OTG_HCCHAR_EPTYP_SHIFT) /* Interrupt */

#define OTG_HCCHAR_MCNT_SHIFT         (20)      /* Bits 20-21: Multicount */
#define OTG_HCCHAR_MCNT_MASK          (3 << OTG_HCCHAR_MCNT_SHIFT)
#define OTG_HCCHAR_DAD_SHIFT          (22)      /* Bits 22-28: Device address */
#define OTG_HCCHAR_DAD_MASK           (0x7f << OTG_HCCHAR_DAD_SHIFT)
#define OTG_HCCHAR_ODDFRM             (1 << 29) /* Bit 29: Odd frame */
#define OTG_HCCHAR_CHDIS              (1 << 30) /* Bit 30: Channel disable */
#define OTG_HCCHAR_CHENA              (1 << 31) /* Bit 31: Channel enable */

/* Host channel-n interrupt and Host channel-0 interrupt mask registers */

#define OTG_HCINT_XFRC                (1 << 0)  /* Bit 0:  Transfer completed */
#define OTG_HCINT_CHH                 (1 << 1)  /* Bit 1:  Channel halted */
/* Bit 2:  Reserved, must be kept at reset value */
#define OTG_HCINT_STALL               (1 << 3)  /* Bit 3:  STALL response received interrupt */
#define OTG_HCINT_NAK                 (1 << 4)  /* Bit 4:  NAK response received interrupt */
#define OTG_HCINT_ACK                 (1 << 5)  /* Bit 5:  ACK response received/transmitted interrupt */
#define OTG_HCINT_NYET                (1 << 6)  /* Bit 6:  Response received interrupt */
#define OTG_HCINT_TXERR               (1 << 7)  /* Bit 7:  Transaction error */
#define OTG_HCINT_BBERR               (1 << 8)  /* Bit 8:  Babble error */
#define OTG_HCINT_FRMOR               (1 << 9)  /* Bit 9:  Frame overrun */
#define OTG_HCINT_DTERR               (1 << 10) /* Bit 10: Data toggle error */
/* Bits 11-31 Reserved, must be kept at reset value */

/* Host channel-n interrupt register */

#define OTG_HCTSIZ_XFRSIZ_SHIFT       (0)       /* Bits 0-18: Transfer size */
#define OTG_HCTSIZ_XFRSIZ_MASK        (0x7ffff << OTG_HCTSIZ_XFRSIZ_SHIFT)
#define OTG_HCTSIZ_PKTCNT_SHIFT       (19)      /* Bits 19-28: Packet count */
#define OTG_HCTSIZ_PKTCNT_MASK        (0x3ff << OTG_HCTSIZ_PKTCNT_SHIFT)
#define OTG_HCTSIZ_DPID_SHIFT         (29)      /* Bits 29-30: Data PID */
#define OTG_HCTSIZ_DPID_MASK          (3 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA0       (0 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA2       (1 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA1       (2 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_MDATA       (3 << OTG_HCTSIZ_DPID_SHIFT) /* Non-control */
#  define OTG_HCTSIZ_PID_SETUP        (3 << OTG_HCTSIZ_DPID_SHIFT) /* Control */

/*                                                 Bit 31 Reserved,
 *                                                must be kept at reset value
 */

/* Device-mode control and status registers */

/* Device configuration register */

#define OTG_DCFG_DSPD_SHIFT           (0)       /* Bits 0-1: Device speed */
#define OTG_DCFG_DSPD_MASK            (3 << OTG_DCFG_DSPD_SHIFT)
#  define OTG_DCFG_DSPD_HS            (0 << OTG_DCFG_DSPD_SHIFT) /* High Speed */
#  define OTG_DCFG_DSPD_FS_USING_HS   (1 << OTG_DCFG_DSPD_SHIFT) /* Full speed using High Speed*/
#  define OTG_DCFG_DSPD_FS            (3 << OTG_DCFG_DSPD_SHIFT) /* Full speed */

#define OTG_DCFG_NZLSOHSK             (1 << 2)  /* Bit 2:  Non-zero-length status OUT handshake */
/* Bit 3:  Reserved, must be kept at reset value */
#define OTG_DCFG_DAD_SHIFT            (4)       /* Bits 4-10: Device address */
#define OTG_DCFG_DAD_MASK             (0x7f << OTG_DCFG_DAD_SHIFT)
#define OTG_DCFG_PFIVL_SHIFT          (11)      /* Bits 11-12: Periodic frame interval */
#define OTG_DCFG_PFIVL_MASK           (3 << OTG_DCFG_PFIVL_SHIFT)
#  define OTG_DCFG_PFIVL_80PCT        (0 << OTG_DCFG_PFIVL_SHIFT) /* 80% of the frame interval */
#  define OTG_DCFG_PFIVL_85PCT        (1 << OTG_DCFG_PFIVL_SHIFT) /* 85% of the frame interval */
#  define OTG_DCFG_PFIVL_90PCT        (2 << OTG_DCFG_PFIVL_SHIFT) /* 90% of the frame interval */
#  define OTG_DCFG_PFIVL_95PCT        (3 << OTG_DCFG_PFIVL_SHIFT) /* 95% of the frame interval */

/*                                                 Bits 13-31 Reserved,
 *                                               must be kept at reset value
 */

/* Device control register */

#define OTG_TESTMODE_DISABLED         (0) /* Test mode disabled */
#define OTG_TESTMODE_J                (1) /* Test_J mode */
#define OTG_TESTMODE_K                (2) /* Test_K mode */
#define OTG_TESTMODE_SE0_NAK          (3) /* Test_SE0_NAK mode */
#define OTG_TESTMODE_PACKET           (4) /* Test_Packet mode */
#define OTG_TESTMODE_FORCE            (5) /* Test_Force_Enable */

#define OTG_DCTL_RWUSIG               (1 << 0)  /* Bit 0:  Remote wakeup signaling */
#define OTG_DCTL_SDIS                 (1 << 1)  /* Bit 1:  Soft disconnect */
#define OTG_DCTL_GINSTS               (1 << 2)  /* Bit 2:  Global IN NAK status */
#define OTG_DCTL_GONSTS               (1 << 3)  /* Bit 3:  Global OUT NAK status */
#define OTG_DCTL_TCTL_SHIFT           (4)       /* Bits 4-6: Test control */
#define OTG_DCTL_TCTL_MASK            (7 << OTG_DCTL_TCTL_SHIFT)
#  define OTG_DCTL_TCTL_DISABLED      (0 << OTG_DCTL_TCTL_SHIFT) /* Test mode disabled */
#  define OTG_DCTL_TCTL_J             (1 << OTG_DCTL_TCTL_SHIFT) /* Test_J mode */
#  define OTG_DCTL_TCTL_K             (2 << OTG_DCTL_TCTL_SHIFT) /* Test_K mode */
#  define OTG_DCTL_TCTL_SE0_NAK       (3 << OTG_DCTL_TCTL_SHIFT) /* Test_SE0_NAK mode */
#  define OTG_DCTL_TCTL_PACKET        (4 << OTG_DCTL_TCTL_SHIFT) /* Test_Packet mode */
#  define OTG_DCTL_TCTL_FORCE         (5 << OTG_DCTL_TCTL_SHIFT) /* Test_Force_Enable */

#define OTG_DCTL_SGINAK               (1 << 7)  /* Bit 7:  Set global IN NAK */
#define OTG_DCTL_CGINAK               (1 << 8)  /* Bit 8:  Clear global IN NAK */
#define OTG_DCTL_SGONAK               (1 << 9)  /* Bit 9:  Set global OUT NAK */
#define OTG_DCTL_CGONAK               (1 << 10) /* Bit 10: Clear global OUT NAK */
#define OTG_DCTL_POPRGDNE             (1 << 11) /* Bit 11: Power-on programming done */
/* Bits 12-31: Reserved, must be kept at reset value */

/* Device status register */

