Y334275/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32s3/include/px4_arch/usb_device.h
#define OTG_DSTS_SUSPSTS              (1 << 0)  /* Bit 0: Suspend status */
#define OTG_DSTS_ENUMSPD_SHIFT        (1)       /* Bits 1-2: Enumerated speed */
#define OTG_DSTS_ENUMSPD_MASK         (3 << OTG_DSTS_ENUMSPD_SHIFT)
#  define OTG_DSTS_ENUMSPD_FS         (3 << OTG_DSTS_ENUMSPD_MASK) /* Full speed */

/*                                                 Bits 4-7: Reserved,
 *                                                must be kept at reset value
 */
#define OTG_DSTS_EERR                 (1 << 3)  /* Bit 3: Erratic error */
#define OTG_DSTS_SOFFN_SHIFT          (8)       /* Bits 8-21: Frame number of the received SOF */
#define OTG_DSTS_SOFFN_MASK           (0x3fff << OTG_DSTS_SOFFN_SHIFT)
#define OTG_DSTS_SOFFN0               (1 << 8)  /* Bits 8: Frame number even/odd bit */
#define OTG_DSTS_SOFFN_EVEN           0
#define OTG_DSTS_SOFFN_ODD            OTG_DSTS_SOFFN0
/* Bits 22-31: Reserved, must be kept at reset value */

/* Device IN endpoint common interrupt mask register */

#define OTG_DIEPMSK_XFRCM             (1 << 0)  /* Bit 0: Transfer completed interrupt mask */
#define OTG_DIEPMSK_EPDM              (1 << 1)  /* Bit 1: Endpoint disabled interrupt mask */
#define OTG_DIEPMSK_AHBERRM           (1 << 2)  /* Bit 2: AHB error mask for USB OTG HS */
#define OTG_DIEPMSK_TOM               (1 << 3)  /* Bit 3: Timeout condition mask (Non-isochronous endpoints) */
#define OTG_DIEPMSK_ITTXFEMSK         (1 << 4)  /* Bit 4: IN token received when TxFIFO empty mask */
#define OTG_DIEPMSK_INEPNMM           (1 << 5)  /* Bit 5: IN token received with EP mismatch mask */
#define OTG_DIEPMSK_INEPNEM           (1 << 6)  /* Bit 6: IN endpoint NAK effective mask */
/* Bit 7: Reserved, must be kept at reset value */
#define OTG_DIEPMSK_TXFURM            (1 << 8)  /* Bit 8: FIFO underrun mask */
/* Bits 9-12: Reserved, must be kept at reset value */
#define OTG_DIEPMSK_NAKM              (1 << 13) /* Bit 13: NAK interrupt mask */
/* Bits 14-31: Reserved, must be kept at reset value */

/* Device OUT endpoint common interrupt mask register */

#define OTG_DOEPMSK_XFRCM             (1 << 0)  /* Bit 0: Transfer completed interrupt mask */
#define OTG_DOEPMSK_EPDM              (1 << 1)  /* Bit 1: Endpoint disabled interrupt mask */
/* Bit 2:  Reserved, must be kept at reset value */
#define OTG_DOEPMSK_STUPM             (1 << 3)  /* Bit 3: SETUP phase done mask */
#define OTG_DOEPMSK_OTEPDM            (1 << 4)  /* Bit 4: OUT token received when endpoint disabled mask */
/* Bits 5-31: Reserved, must be kept at reset value */

/* Device all endpoints interrupt and All endpoints interrupt
 * mask registers
 */

#define OTG_DAINT_IEP_SHIFT           (0)       /* Bits 0-15: IN endpoint interrupt bits */
#define OTG_DAINT_IEP_MASK            (0xffff << OTG_DAINT_IEP_SHIFT)
#  define OTG_DAINT_IEP(n)            (1 << (n))
#define OTG_DAINT_OEP_SHIFT           (16)      /* Bits 16-31: OUT endpoint interrupt bits */
#define OTG_DAINT_OEP_MASK            (0xffff << OTG_DAINT_OEP_SHIFT)
#  define OTG_DAINT_OEP(n)            (1 << ((n)+16))

/* Device VBUS discharge time register */

#define OTG_DVBUSDIS_MASK             (0xffff)

/* Device VBUS pulsing time register */

#define OTG_DVBUSPULSE_MASK           (0xfff)

/* Device IN endpoint FIFO empty interrupt mask register */

#define OTG_DIEPEMPMSK(n)             (1 << (n))

/* Device control IN endpoint 0 control register */

#define OTG_DIEPCTL0_MPSIZ_SHIFT      (0)       /* Bits 0-1: Maximum packet size */
#define OTG_DIEPCTL0_MPSIZ_MASK       (3 << OTG_DIEPCTL0_MPSIZ_SHIFT)
#  define OTG_DIEPCTL0_MPSIZ_64       (0 << OTG_DIEPCTL0_MPSIZ_SHIFT) /* 64 bytes */
#  define OTG_DIEPCTL0_MPSIZ_32       (1 << OTG_DIEPCTL0_MPSIZ_SHIFT) /* 32 bytes */
#  define OTG_DIEPCTL0_MPSIZ_16       (2 << OTG_DIEPCTL0_MPSIZ_SHIFT) /* 16 bytes */
#  define OTG_DIEPCTL0_MPSIZ_8        (3 << OTG_DIEPCTL0_MPSIZ_SHIFT) /* 8 bytes */

/*                                                 Bits 2-14: Reserved,
 *                                                must be kept at reset value
 */
#define OTG_DIEPCTL0_USBAEP           (1 << 15) /* Bit 15: USB active endpoint */
/* Bit 16: Reserved, must be kept at reset value */
#define OTG_DIEPCTL0_NAKSTS           (1 << 17) /* Bit 17: NAK status */
#define OTG_DIEPCTL0_EPTYP_SHIFT      (18)      /* Bits 18-19: Endpoint type */
#define OTG_DIEPCTL0_EPTYP_MASK       (3 << OTG_DIEPCTL0_EPTYP_SHIFT)
#  define OTG_DIEPCTL0_EPTYP_CTRL     (0 << OTG_DIEPCTL0_EPTYP_SHIFT) /* Control (hard-coded) */

/*                                                 Bit 20: Reserved,
 *                                                must be kept at reset value
 */
#define OTG_DIEPCTL0_STALL            (1 << 21) /* Bit 21: STALL handshake */
#define OTG_DIEPCTL0_TXFNUM_SHIFT     (22)      /* Bits 22-25: TxFIFO number */
#define OTG_DIEPCTL0_TXFNUM_MASK      (15 << OTG_DIEPCTL0_TXFNUM_SHIFT)
#define OTG_DIEPCTL0_CNAK             (1 << 26) /* Bit 26: Clear NAK */
#define OTG_DIEPCTL0_SNAK             (1 << 27) /* Bit 27: Set NAK */
/* Bits 28-29: Reserved, must be kept at reset value */
#define OTG_DIEPCTL0_EPDIS            (1 << 30) /* Bit 30: Endpoint disable */
#define OTG_DIEPCTL0_EPENA            (1 << 31) /* Bit 31: Endpoint enable */

/* Device control IN endpoint n control register */

#define OTG_DIEPCTL_MPSIZ_SHIFT       (0)       /* Bits 0-10: Maximum packet size */
#define OTG_DIEPCTL_MPSIZ_MASK        (0x7ff << OTG_DIEPCTL_MPSIZ_SHIFT)
/* Bits 11-14: Reserved, must be kept at reset value */
#define OTG_DIEPCTL_USBAEP            (1 << 15) /* Bit 15: USB active endpoint */
#define OTG_DIEPCTL_EONUM             (1 << 16) /* Bit 16: Even/odd frame */
#  define OTG_DIEPCTL_EVEN            (0)
#  define OTG_DIEPCTL_ODD             OTG_DIEPCTL_EONUM
#  define OTG_DIEPCTL_DATA0           (0)
#  define OTG_DIEPCTL_DATA1           OTG_DIEPCTL_EONUM
#define OTG_DIEPCTL_NAKSTS            (1 << 17) /* Bit 17: NAK status */
#define OTG_DIEPCTL_EPTYP_SHIFT       (18)      /* Bits 18-19: Endpoint type */
#define OTG_DIEPCTL_EPTYP_MASK        (3 << OTG_DIEPCTL_EPTYP_SHIFT)
#  define OTG_DIEPCTL_EPTYP_CTRL      (0 << OTG_DIEPCTL_EPTYP_SHIFT) /* Control */
#  define OTG_DIEPCTL_EPTYP_ISOC      (1 << OTG_DIEPCTL_EPTYP_SHIFT) /* Isochronous */
#  define OTG_DIEPCTL_EPTYP_BULK      (2 << OTG_DIEPCTL_EPTYP_SHIFT) /* Bulk */
#  define OTG_DIEPCTL_EPTYP_INTR      (3 << OTG_DIEPCTL_EPTYP_SHIFT) /* Interrupt */

/*                                                 Bit 20: Reserved,
 *                                              must be kept at reset value
 */
#define OTG_DIEPCTL_STALL             (1 << 21) /* Bit 21: STALL handshake */
#define OTG_DIEPCTL_TXFNUM_SHIFT      (22)      /* Bits 22-25: TxFIFO number */
#define OTG_DIEPCTL_TXFNUM_MASK       (15 << OTG_DIEPCTL_TXFNUM_SHIFT)
#define OTG_DIEPCTL_CNAK              (1 << 26) /* Bit 26: Clear NAK */
#define OTG_DIEPCTL_SNAK              (1 << 27) /* Bit 27: Set NAK */
#define OTG_DIEPCTL_SD0PID            (1 << 28) /* Bit 28: Set DATA0 PID (interrupt/bulk) */
#define OTG_DIEPCTL_SEVNFRM           (1 << 28) /* Bit 28: Set even frame (isochronous)) */
#define OTG_DIEPCTL_SODDFRM           (1 << 29) /* Bit 29: Set odd frame (isochronous) */
#define OTG_DIEPCTL_EPDIS             (1 << 30) /* Bit 30: Endpoint disable */
#define OTG_DIEPCTL_EPENA             (1 << 31) /* Bit 31: Endpoint enable */

